Autodesk.Revit.DB.BuiltInFailures.RoomFailures.SpaceUnplaceWarning
A Space was deleted from all model views but still remains in this project. \n The Space can be removed from any schedule or placed back in the model using the Space command.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.ShowRoomBoundingElements
[Room] Bounding elements are highlighted.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsReallyFailed
[Room] computations failed. Try to modify the following elements.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsOverlapInHeight
[Room] volumes overlap. Adjust the Upper Limit and Limit Offset properties of the [rooms].

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsInSameRegionSpaces
Multiple [Room] are in the same enclosed region.  The correct area and perimeter will be assigned to one [Room] and the others will display     "Redundant [Room]."  You should separate the regions, delete the extra [Room], or move them into different regions.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsInSameRegionRooms
Multiple [Room] are in the same enclosed region.  The correct area and perimeter will be assigned to one [Room] and the others will display     "Redundant [Room]."  You should separate the regions, delete the extra [Room], or move them into different regions.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsInSameRegionAreas
Multiple [Room] are in the same enclosed region.  The correct area and perimeter will be assigned to one [Room] and the others will display     "Redundant [Room]."  You should separate the regions, delete the extra [Room], or move them into different regions.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsInSameRegion
Multiple [Room] are in the same enclosed region.  The correct area and perimeter will be assigned to one [Room] and the others will display     "Redundant [Room]."  You should separate the regions, delete the extra [Room], or move them into different regions.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsFailed
[Room] computations only succeeded without considering the following elements.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsCreatedAutomatically
[Room] [Room] created automatically.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomUnplaceWarning
A Room was deleted from all model views but still remains in this project. \n The room can be removed from any schedule or placed back in the model using the Room command.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTooShort
[Room] is very short. If this is not intended, change its Upper Limit and Offset.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagVolumeNotComputed
[Room] Tag is displaying volume that can't be computed.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToSpace
[Room] Tag is outside of its [Room].  Enable Leader or move [Room] Tag within its [Room].

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToRoom
[Room] Tag is outside of its [Room].  Enable Leader or move [Room] Tag within its [Room].

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToArea
[Room] Tag is outside of its [Room].  Enable Leader or move [Room] Tag within its [Room].

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoom
[Room] Tag is outside of its [Room].  Enable Leader or move [Room] Tag within its [Room].

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagDeleted
A [Room] Tag was deleted, but the corresponding [Room] still exists.  You can place another tag for the [Room] using the [Room] Tag tool or select the [Room] and delete it.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagBadViewType
[Room] Tags can only be placed in Floor Plan, Reflected Ceiling Plan and Section Views.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedSpaces
[Room] is not in a properly enclosed region

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedRooms
[Room] is not in a properly enclosed region

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedAreas
[Room] is not in a properly enclosed region

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosed
[Room] is not in a properly enclosed region

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomLevelElevs
A [Room]s Upper Limit must be above its Base Level.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomHeightNegative
[Room] must have a height greater than 0.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBoundaryMisalignment
[Room] bounding element might be misaligned.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBelowCompHeight
[Room] Volume is being calculated above the Upper Limit of this [Room]. Change the Upper Limit and Offset or change the height of volume calculations.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBaseAboveComputationHeight
[RoomBase]'s lower offset is above the Computation Height

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictRoomOverlapOption
Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in Option '[Option Name]'.\nTo resolve, delete the duplicate Room or divide space with Room Separation Lines in the Main Model.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictRoomOverlapMain
Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in the Main Model.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkRoomOverlapOption
Option conflict between rooms in the Revit link '[Link Instance Name]'.\nA room in the Revit link's option '[Option #1 Name in Link]' overlaps a room in the Revit link's option '[Option #2 Name in Link]'.\nTo resolve the issue, open the Revit link file for editing, and delete the duplicate room or use room separation lines to divide the space in the main model.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkRoomOverlapMain
Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room in the Revit link's option '[Option Name in Link]' overlaps a room in the main model.\nTo resolve the issue, open the Revit link file for editing, select the main model room, and use the Add to Design Option Set tool.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryOptionSeparate
Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, and use room separation lines to divide the space in the main model.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryMainSeparate
Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary in the main model of the Revit link differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, and use room separation lines to divide the space in the main model.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryMainAddToOptionSet
Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary in the main model of the Revit link differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, select the main model room, and use the Add to Design Option Set tool.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryOptionSeparate
Option Conflict between Rooms.\nRoom boundary differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainSeparate
Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainAddToOptionSet
Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.InvisibleRoomBoundElemement
[Room] Bounding element is invisible in current view.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.InvalidReflectivityPercentage
The value for Reflectivity must be between 0 and 1.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.ExtensionsOverlapWarning
Vertical Extensions on these Walls overlap. This can cause undesirable Joins. Try starting with no overlap and extend the Walls toward one another.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.CannotMakeRoomsGeometry
Could not create geometry for [Room].

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.AreaUnplaceWarning
An Area was deleted from all model views but still remains in this project. \n The area can be removed from any schedule or placed back in the model using the Area command.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures.AreaTagBadViewType
Can't Copy Area Tags. The target view doesn't have the same Area Scheme as the original view.

Autodesk.Revit.DB.BuiltInFailures.RoomFailures
Failures about Room.